In [1]:
###inbuilt DATABASE in Pandas

In [2]:
import sqlite3 as sl

In [3]:
conn = sl.connect('sandy.db')

In [5]:
with conn:
    conn.execute("""
                CREATE TABLE FASS(
                id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
                Name TEXT ,
                age INTEGER 
                                );
                """)

In [6]:
sql = 'INSERT INTO FASS(id,name,age)values(?,?,?) '
data = [
        (1,'sandy',22),
        (2,'Rohit',23),
        (3,'Vampire',22)
]

In [7]:
data

[(1, 'sandy', 22), (2, 'Rohit', 23), (3, 'Vampire', 22)]

In [8]:
### to insert the data in data base
with conn:
    conn.executemany(sql,data)

In [9]:
import pandas as pd
df1 = pd.DataFrame({'userid' : [1,1,1,2,3,3,3,3],
                   'skill': ['Data Science','Network Security','SS','CS','ML','Python','R','Tableau']})

In [10]:
df1

   userid             skill
0       1      Data Science
1       1  Network Security
2       1                SS
3       2                CS
4       3                ML
5       3            Python
6       3                 R
7       3           Tableau

In [11]:
df1.to_sql('Skill',conn)

In [18]:
df = pd.read_sql('''
                SELECT s.userid,u.name,u.age,s.skill
                FROM user u LEFT JOIN SKILL s ON u.id = s.userid
                ''',conn)

In [19]:
df #### output is a joined table in database in pandas via SQL

   userid     Name  age             skill
0       1    sandy   22      Data Science
1       1    sandy   22  Network Security
2       1    sandy   22                SS
3       2    Rohit   23                CS
4       3  Vampire   22                ML
5       3  Vampire   22            Python
6       3  Vampire   22                 R
7       3  Vampire   22           Tableau